class UserMessages:
    start_mes = "Этот бот поможет тебе находить новый контент в твоих любимых источниках и делиться им в своем " \
                "телеграм канале. Чтобы начать пользоваться ботом, сделай его админом со всеми правами в своем " \
                "телеграм-канале. После этого воспользуйся командой /set_channel"
    source_choice_mes = "Выбери тип источника, который хочешь добавить, с помощью кнопок ниже"
    add_tg_mes = "Отправь мне ссылку на нужный канал/чат в формате @name или https://t.me/name"
    add_vk_mes = "Отправь мне ссылку на нужное сообщество в формате https://vk.com/name"
    add_site_mes = "Отправь мне ссылку на нужный сайт"
    url_mistake_mes = "Кажется вы ввели некореектную ссылку на сайт:( Попробуйте еще раз"
    url_success_mes = "Отлично, новый источник был добавлен"
    no_channel_mes = "Пожалуйста, выбирете канал, который хотите модерировать, с помощью команды /set_channel ." \
                     " Без этого бот не сможет начать работу."
    chan_success_mes = "Отлично, канал для модерации был добавлен. Теперь вы можете добавлять ваши любимые источники " \
                       "контента с помощью команды /add_new_source"
    no_sources_mes = "Вы еще не добавили источники, из которых хотите получать информацию. Сделайте это с помощью " \
                     "команды /add_new_source "
    delete_source_mes = "Выберите какой из источников вы хотите удалить"
    source_del_suc_mes = "Вы больше не будете получать контент из этого источника"
    chan_mistake_mes = "Кажется вы отправили что-то не то. Проверьте правильность и попробуйте еще раз."
    set_channel_mes_1 = "На данный момент вы модерируете канал "
    set_channel_mes_2 = "На данный момент у вас не установлен никакой канал для модерации"
    set_channel_mes_3 = "Перешлите мне любое сообщение из канала, который хотите модерировать. " \
                        "Не забудьте сделать этого бота админом со всеми правами в этом канале, иначе бот просто не " \
                        "сможет ничего туда выкладывать."
    parse_time_mes = "Выберите контент за какой срок вы хотите получить"
